src/Enums/ВидСчета/ВидСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСчета</name>
  <enumValues>
    <name>Кошелек</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Счета</name>
  <predefined>
    <items>
      <name>БанковскийСчет</name>
      <description>Банковский счет</description>
    </items>
    <items>
      <name>Карта</name>
      <description>Карта</description>
    </items>
    <items>
      <name>Кошелек</name>
      <description>Кошелек</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидСчета</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Контакты/Контакты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контакты</name>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ОбщийМодульСервер_СправочникиUI/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// HTML-формы справочников Счета, Валюта, Контакты (Wallet).
// Без групп. Для счетов и валют — без иконок.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Счета

// HTML списка счетов.
//
Функция HTMLСпискаСчетов(СтрокаПоиска = "") Экспорт
	
	Акцент = АкцентСчетов();
	Таблица = ТаблицаСчетов(СтрокаПоиска);
	
	Строки = Новый Массив;
	ДобавитьШапку(Строки, СтилиСписка(Акцент));
	ДобавитьШапкуСписка(Строки, "Счета", СтрокаПоиска, "Поиск счёта",
		"Счета используются в операциях и переводах");
	Строки.Добавить("<div class=""list"">");
	
	Если Таблица.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">Счета не найдены</div>");
		
	Иначе
		
		Для Каждого СтрокаСчета Из Таблица Цикл
			
			Ссылка = "app:open:" + Строка(СтрокаСчета.Ссылка.УникальныйИдентификатор());
			Подпись = ПредставлениеВидаСчета(СтрокаСчета.ВидСчета);
			Строки.Добавить("<a class=""item"" href=""" + Ссылка + """>");
			Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(СтрокаСчета.Наименование)
				+ "</span><span class=""sub"">" + ЭкранироватьHTML(Подпись) + "</span></span>");
			Строки.Добавить("<span class=""chev"">›</span></a>");
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строки.Добавить("</div></body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// HTML выбора счёта.
//
Функция HTMLВыбораСчетов(ТекущийСчет = Неопределено, СтрокаПоиска = "") Экспорт
	
	Акцент = АкцентСчетов();
	Таблица = ТаблицаСчетов(СтрокаПоиска);
	
	Строки = Новый Массив;
	ДобавитьШапку(Строки, СтилиСписка(Акцент) + СтилиКнопки(Акцент));
	ДобавитьШапкуСписка(Строки, "Выбор счёта", СтрокаПоиска, "Найти счёт",
		"Выберите счёт для операции");
	Строки.Добавить("<div class=""list choice"">");
	
	Если Таблица.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">Счета не найдены</div>");
		
	Иначе
		
		Для Каждого СтрокаСчета Из Таблица Цикл
			
			Выбран = ЗначениеЗаполнено(ТекущийСчет) И СтрокаСчета.Ссылка = ТекущийСчет;
			Класс = ?(Выбран, "item selected", "item");
			Ссылка = "app:pick:" + Строка(СтрокаСчета.Ссылка.УникальныйИдентификатор());
			Подпись = ПредставлениеВидаСчета(СтрокаСчета.ВидСчета);
			Строки.Добавить("<a class=""" + Класс + """ href=""" + Ссылка + """>");
			Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(СтрокаСчета.Наименование)
				+ "</span><span class=""sub"">" + ЭкранироватьHTML(Подпись) + "</span></span>");
			Строки.Добавить(?(Выбран, "<span class=""check"">✓</span>", "<span class=""chev"">›</span>"));
			Строки.Добавить("</a>");
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строки.Добавить("</div>");
	
	Если ЗначениеЗаполнено(ТекущийСчет) Тогда
		
		Строки.Добавить("<div class=""footer""><a class=""btn"" href=""app:confirm"">Выбрать: "
			+ ЭкранироватьHTML(Строка(ТекущийСчет)) + "</a></div>");
		
	КонецЕсли;
	
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// HTML элемента счёта.
//
Функция HTMLЭлементаСчета(Данные, РежимВыбораВида = Ложь) Экспорт
	
	Акцент = АкцентСчетов();
	
	Если РежимВыбораВида Тогда
		
		Возврат HTMLВыбораВидаСчета(Данные, Акцент);
		
	КонецЕсли;
	
	Наименование = ?(ЗначениеЗаполнено(Данные.Наименование), Данные.Наименование, "Без названия");
	ВидТекст = ?(ЗначениеЗаполнено(Данные.ВидСчетаТекст), Данные.ВидСчетаТекст, "Выберите вид счёта");
	МожноЗаписать = ЗначениеЗаполнено(Данные.Наименование) И ЗначениеЗаполнено(Данные.ВидСчета);
	
	Строки = Новый Массив;
	ДобавитьШапку(Строки, СтилиЭлемента(Акцент));
	ДобавитьШапкуЭлемента(Строки, "Счёт", Данные.Предопределенный);
	Строки.Добавить("<a class=""card"" href=""app:name""><span class=""label"">Наименование</span>"
		+ "<span class=""value"">" + ЭкранироватьHTML(Наименование) + "</span></a>");
	Строки.Добавить("<a class=""card"" href=""app:kind""><span class=""label"">Вид счёта</span>"
		+ "<span class=""value"">" + ЭкранироватьHTML(ВидТекст) + "</span></a>");
	Строки.Добавить("<div class=""info"">Счёт будет доступен в документах дохода, расхода и переводах</div>");
	ДобавитьКнопкуЗаписи(Строки, МожноЗаписать, "Записать счёт", "Укажите наименование и вид");
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

Функция СчетПоИдентификатору(ИдентификаторСтрокой) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтрокой) Тогда
		
		Возврат Справочники.Счета.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Справочники.Счета.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторСтрокой));
	
КонецФункции

Функция ВидСчетаПоИмени(ИмяВида) Экспорт
	
	Если ИмяВида = "Кошелек" Тогда
		
		Возврат Перечисления.ВидСчета.Кошелек;
		
	ИначеЕсли ИмяВида = "БанковскаяКарта" Тогда
		
		Возврат Перечисления.ВидСчета.БанковскаяКарта;
		
	ИначеЕсли ИмяВида = "БанковскийСчет" Тогда
		
		Возврат Перечисления.ВидСчета.БанковскийСчет;
		
	КонецЕсли;
	
	Возврат Перечисления.ВидСчета.ПустаяСсылка();
	
КонецФункции

Функция ПредставлениеВидаСчета(ВидСчета) Экспорт
	
	Если ВидСчета = Перечисления.ВидСчета.Кошелек Тогда
		
		Возврат "Наличные";
		
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскаяКарта Тогда
		
		Возврат "Банковская карта";
		
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскийСчет Тогда
		
		Возврат "Банковский счёт";
		
	КонецЕсли;
	
	Возврат "Не указан";
	
КонецФункции

#КонецОбласти

#Область Валюта

// HTML списка валют.
//
Функция HTMLСпискаВалют(СтрокаПоиска = "") Экспорт
	
	Акцент = АкцентВалют();
	Таблица = ТаблицаВалют(СтрокаПоиска);
	
	Строки = Новый Массив;
	ДобавитьШапку(Строки, СтилиСписка(Акцент));
	ДобавитьШапкуСписка(Строки, "Валюты", СтрокаПоиска, "Поиск валюты",
		"Валюты используются в операциях и курсах");
	Строки.Добавить("<div class=""list"">");
	
	Если Таблица.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">Валюты не найдены</div>");
		
	Иначе
		
		Для Каждого СтрокаВалюты Из Таблица Цикл
			
			Ссылка = "app:open:" + Строка(СтрокаВалюты.Ссылка.УникальныйИдентификатор());
			Строки.Добавить("<a class=""item"" href=""" + Ссылка + """>");
			Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(СтрокаВалюты.Наименование)
				+ "</span><span class=""sub"">" + ЭкранироватьHTML(СтрокаВалюты.Код) + "</span></span>");
			Строки.Добавить("<span class=""chev"">›</span></a>");
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строки.Добавить("</div></body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// HTML выбора валюты.
//
Функция HTMLВыбораВалют(ТекущаяВалюта = Неопределено, СтрокаПоиска = "") Экспорт
	
	Акцент = АкцентВалют();
	Таблица = ТаблицаВалют(СтрокаПоиска);
	
	Строки = Новый Массив;
	ДобавитьШапку(Строки, СтилиСписка(Акцент) + СтилиКнопки(Акцент));
	ДобавитьШапкуСписка(Строки, "Выбор валюты", СтрокаПоиска, "Найти валюту",
		"Выберите валюту для операции");
	Строки.Добавить("<div class=""list choice"">");
	
	Если Таблица.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">Валюты не найдены</div>");
		
	Иначе
		
		Для Каждого СтрокаВалюты Из Таблица Цикл
			
			Выбран = ЗначениеЗаполнено(ТекущаяВалюта) И СтрокаВалюты.Ссылка = ТекущаяВалюта;
			Класс = ?(Выбран, "item selected", "item");
			Ссылка = "app:pick:" + Строка(СтрокаВалюты.Ссылка.УникальныйИдентификатор());
			Строки.Добавить("<a class=""" + Класс + """ href=""" + Ссылка + """>");
			Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(СтрокаВалюты.Наименование)
				+ "</span><span class=""sub"">" + ЭкранироватьHTML(СтрокаВалюты.Код) + "</span></span>");
			Строки.Добавить(?(Выбран, "<span class=""check"">✓</span>", "<span class=""chev"">›</span>"));
			Строки.Добавить("</a>");
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строки.Добавить("</div>");
	
	Если ЗначениеЗаполнено(ТекущаяВалюта) Тогда
		
		Строки.Добавить("<div class=""footer""><a class=""btn"" href=""app:confirm"">Выбрать: "
			+ ЭкранироватьHTML(Строка(ТекущаяВалюта)) + "</a></div>");
		
	КонецЕсли;
	
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// HTML элемента валюты.
//
Функция HTMLЭлементаВалюты(Данные) Экспорт
	
	Акцент = АкцентВалют();
	Наименование = ?(ЗначениеЗаполнено(Данные.Наименование), Данные.Наименование, "Без названия");
	Код = ?(ЗначениеЗаполнено(Данные.Код), Данные.Код, "Код");
	МожноЗаписать = ЗначениеЗаполнено(Данные.Наименование) И ЗначениеЗаполнено(Данные.Код);
	
	Строки = Новый Массив;
	ДобавитьШапку(Строки, СтилиЭлемента(Акцент));
	ДобавитьШапкуЭлемента(Строки, "Валюта", Данные.Предопределенный);
	Строки.Добавить("<a class=""card"" href=""app:code""><span class=""label"">Код</span>"
		+ "<span class=""value"">" + ЭкранироватьHTML(Код) + "</span></a>");
	Строки.Добавить("<a class=""card"" href=""app:name""><span class=""label"">Наименование</span>"
		+ "<span class=""value"">" + ЭкранироватьHTML(Наименование) + "</span></a>");
	Строки.Добавить("<div class=""info"">Валюта будет доступна в операциях и регистре курсов</div>");
	ДобавитьКнопкуЗаписи(Строки, МожноЗаписать, "Записать валюту", "Укажите код и наименование");
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

Функция ВалютаПоИдентификатору(ИдентификаторСтрокой) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтрокой) Тогда
		
		Возврат Справочники.Валюта.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Справочники.Валюта.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторСтрокой));
	
КонецФункции

#КонецОбласти

#Область Контакты

// HTML списка контактов.
//
Функция HTMLСпискаКонтактов(СтрокаПоиска = "") Экспорт
	
	Акцент = АкцентКонтактов();
	Таблица = ТаблицаКонтактов(СтрокаПоиска);
	
	Строки = Новый Массив;
	ДобавитьШапку(Строки, СтилиСписка(Акцент));
	ДобавитьШапкуСписка(Строки, "Контакты", СтрокаПоиска, "Поиск контакта",
		"Контакты используются в операциях с долгами");
	Строки.Добавить("<div class=""list"">");
	
	Если Таблица.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">Контакты не найдены</div>");
		
	Иначе
		
		Для Каждого СтрокаКонтакта Из Таблица Цикл
			
			Ссылка = "app:open:" + Строка(СтрокаКонтакта.Ссылка.УникальныйИдентификатор());
			ПодписьТелефона = ФорматТелефонаПоМаске(СтрокаКонтакта.Телефон);
			Подпись = ?(ЗначениеЗаполнено(ПодписьТелефона), ПодписьТелефона,
				?(ЗначениеЗаполнено(СтрокаКонтакта.Почта), СтрокаКонтакта.Почта, "Без контактов"));
			Строки.Добавить("<a class=""item"" href=""" + Ссылка + """>");
			Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(СтрокаКонтакта.Наименование)
				+ "</span><span class=""sub"">" + ЭкранироватьHTML(Подпись) + "</span></span>");
			Строки.Добавить("<span class=""chev"">›</span></a>");
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строки.Добавить("</div></body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// HTML выбора контакта.
//
Функция HTMLВыбораКонтактов(ТекущийКонтакт = Неопределено, СтрокаПоиска = "") Экспорт
	
	Акцент = АкцентКонтактов();
	Таблица = ТаблицаКонтактов(СтрокаПоиска);
	
	Строки = Новый Массив;
	ДобавитьШапку(Строки, СтилиСписка(Акцент) + СтилиКнопки(Акцент));
	ДобавитьШапкуСписка(Строки, "Выбор контакта", СтрокаПоиска, "Найти контакт",
		"Выберите контакт для операции долга");
	Строки.Добавить("<div class=""list choice"">");
	
	Если Таблица.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">Контакты не найдены</div>");
		
	Иначе
		
		Для Каждого СтрокаКонтакта Из Таблица Цикл
			
			Выбран = ЗначениеЗаполнено(ТекущийКонтакт) И СтрокаКонтакта.Ссылка = ТекущийКонтакт;
			Класс = ?(Выбран, "item selected", "item");
			Ссылка = "app:pick:" + Строка(СтрокаКонтакта.Ссылка.УникальныйИдентификатор());
			ПодписьТелефона = ФорматТелефонаПоМаске(СтрокаКонтакта.Телефон);
			Подпись = ?(ЗначениеЗаполнено(ПодписьТелефона), ПодписьТелефона, "Без телефона");
			Строки.Добавить("<a class=""" + Класс + """ href=""" + Ссылка + """>");
			Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(СтрокаКонтакта.Наименование)
				+ "</span><span class=""sub"">" + ЭкранироватьHTML(Подпись) + "</span></span>");
			Строки.Добавить(?(Выбран, "<span class=""check"">✓</span>", "<span class=""chev"">›</span>"));
			Строки.Добавить("</a>");
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строки.Добавить("</div>");
	
	Если ЗначениеЗаполнено(ТекущийКонтакт) Тогда
		
		Строки.Добавить("<div class=""footer""><a class=""btn"" href=""app:confirm"">Выбрать: "
			+ ЭкранироватьHTML(Строка(ТекущийКонтакт)) + "</a></div>");
		
	КонецЕсли;
	
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// HTML элемента контакта.
//
Функция HTMLЭлементаКонтакта(Данные) Экспорт
	
	Акцент = АкцентКонтактов();
	Наименование = ?(ЗначениеЗаполнено(Данные.Наименование), Данные.Наименование, "Без имени");
	ТелефонЗаполнен = ЗначениеЗаполнено(ТолькоЦифрыТелефона(Данные.Телефон));
	Телефон = ?(ТелефонЗаполнен, ФорматТелефонаПоМаске(Данные.Телефон), "Добавить телефон");
	Почта = ?(ЗначениеЗаполнено(Данные.Почта), Данные.Почта, "Добавить почту");
	Комментарий = ?(ЗначениеЗаполнено(Данные.Комментарий), Данные.Комментарий, "Добавить комментарий");
	МожноЗаписать = ЗначениеЗаполнено(Данные.Наименование);
	КлассТелефона = ?(ТелефонЗаполнен, "value", "value muted");
	КлассПочты = ?(ЗначениеЗаполнено(Данные.Почта), "value", "value muted");
	КлассКомментария = ?(ЗначениеЗаполнено(Данные.Комментарий), "value", "value muted");
	
	Строки = Новый Массив;
	ДобавитьШапку(Строки, СтилиЭлемента(Акцент));
	ДобавитьШапкуЭлемента(Строки, "Контакт", Ложь);
	Строки.Добавить("<a class=""card"" href=""app:name""><span class=""label"">Имя</span>"
		+ "<span class=""value"">" + ЭкранироватьHTML(Наименование) + "</span></a>");
	Строки.Добавить("<a class=""card"" href=""app:phone""><span class=""label"">Телефон</span>"
		+ "<span class=""" + КлассТелефона + """>" + ЭкранироватьHTML(Телефон) + "</span></a>");
	Строки.Добавить("<a class=""card"" href=""app:email""><span class=""label"">Почта</span>"
		+ "<span class=""" + КлассПочты + """>" + ЭкранироватьHTML(Почта) + "</span></a>");
	Строки.Добавить("<a class=""card"" href=""app:comment""><span class=""label"">Комментарий</span>"
		+ "<span class=""" + КлассКомментария + """>" + ЭкранироватьHTML(Комментарий) + "</span></a>");
	Строки.Добавить("<div class=""info"">Контакт будет доступен в документах передачи средств в долг</div>");
	ДобавитьКнопкуЗаписи(Строки, МожноЗаписать, "Записать контакт", "Укажите имя");
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

Функция КонтактПоИдентификатору(ИдентификаторСтрокой) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтрокой) Тогда
		
		Возврат Справочники.Контакты.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Справочники.Контакты.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторСтрокой));
	
КонецФункции

#КонецОбласти

// Форматирует номер телефона по маске 9-999-999-99-99.
//
Функция ФорматТелефонаПоМаске(Знач Текст) Экспорт
	
	Цифры = ТолькоЦифрыТелефона(Текст);
	
	Если ПустаяСтрока(Цифры) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Маска = "9-999-999-99-99";
	Результат = "";
	ИндексЦифры = 1;
	
	Для Позиция = 1 По СтрДлина(Маска) Цикл
		
		СимволМаски = Сред(Маска, Позиция, 1);
		
		Если СимволМаски = "9" Тогда
			
			Если ИндексЦифры > СтрДлина(Цифры) Тогда
				
				Прервать;
				
			КонецЕсли;
			
			Результат = Результат + Сред(Цифры, ИндексЦифры, 1);
			ИндексЦифры = ИндексЦифры + 1;
			
		Иначе
			
			Если ИндексЦифры > СтрДлина(Цифры) Тогда
				
				Прервать;
				
			КонецЕсли;
			
			Результат = Результат + СимволМаски;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Оставляет только цифры номера телефона (не более 11).
//
Функция ТолькоЦифрыТелефона(Знач Текст) Экспорт
	
	Результат = "";
	Текст = Строка(Текст);
	
	Для Индекс = 1 По СтрДлина(Текст) Цикл
		
		Символ = Сред(Текст, Индекс, 1);
		
		Если СтрНайти("0123456789", Символ) > 0 Тогда
			
			Результат = Результат + Символ;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрДлина(Результат) > 11 Тогда
		
		Результат = Лев(Результат, 11);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭкранироватьHTML(Знач Текст) Экспорт
	
	Результат = Строка(Текст);
	Результат = СтрЗаменить(Результат, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция HTMLВыбораВидаСчета(Данные, Акцент)
	
	Варианты = Новый Массив;
	Варианты.Добавить(Новый Структура("Имя, Текст", "Кошелек", "Наличные"));
	Варианты.Добавить(Новый Структура("Имя, Текст", "БанковскаяКарта", "Банковская карта"));
	Варианты.Добавить(Новый Структура("Имя, Текст", "БанковскийСчет", "Банковский счёт"));
	
	Строки = Новый Массив;
	ДобавитьШапку(Строки, СтилиСписка(Акцент));
	Строки.Добавить("<div class=""top"">");
	Строки.Добавить("<a class=""icon-btn"" href=""app:kind-back"">" + SVGНазад() + "</a>");
	Строки.Добавить("<div class=""title"">Вид счёта</div>");
	Строки.Добавить("<span class=""icon-btn ghost""></span></div>");
	Строки.Добавить("<div class=""list"">");
	
	Для Каждого Вариант Из Варианты Цикл
		
		Выбран = Данные.ВидСчетаИмя = Вариант.Имя;
		Класс = ?(Выбран, "item selected", "item");
		Строки.Добавить("<a class=""" + Класс + """ href=""app:set-kind:" + Вариант.Имя + """>");
		Строки.Добавить("<span class=""mid""><span class=""name"">" + ЭкранироватьHTML(Вариант.Текст)
			+ "</span></span>");
		Строки.Добавить(?(Выбран, "<span class=""check"">✓</span>", "<span class=""chev"">›</span>"));
		Строки.Добавить("</a>");
		
	КонецЦикла;
	
	Строки.Добавить("</div></body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

Функция ТаблицаСчетов(СтрокаПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Счета.Ссылка КАК Ссылка,
	|	Счета.Наименование КАК Наименование,
	|	Счета.ВидСчета КАК ВидСчета
	|ИЗ
	|	Справочник.Счета КАК Счета
	|ГДЕ
	|	НЕ Счета.ПометкаУдаления
	|	И (&СтрокаПоиска = """"
	|		ИЛИ Счета.Наименование ПОДОБНО &ШаблонПоиска)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("СтрокаПоиска", СокрЛП(СтрокаПоиска));
	Запрос.УстановитьПараметр("ШаблонПоиска", "%" + СокрЛП(СтрокаПоиска) + "%");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаВалют(СтрокаПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Валюта.Ссылка КАК Ссылка,
	|	Валюта.Код КАК Код,
	|	Валюта.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Валюта КАК Валюта
	|ГДЕ
	|	НЕ Валюта.ПометкаУдаления
	|	И (&СтрокаПоиска = """"
	|		ИЛИ Валюта.Наименование ПОДОБНО &ШаблонПоиска
	|		ИЛИ Валюта.Код ПОДОБНО &ШаблонПоиска)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	Запрос.УстановитьПараметр("СтрокаПоиска", СокрЛП(СтрокаПоиска));
	Запрос.УстановитьПараметр("ШаблонПоиска", "%" + СокрЛП(СтрокаПоиска) + "%");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаКонтактов(СтрокаПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контакты.Ссылка КАК Ссылка,
	|	Контакты.Наименование КАК Наименование,
	|	Контакты.Телефон КАК Телефон,
	|	Контакты.Почта КАК Почта
	|ИЗ
	|	Справочник.Контакты КАК Контакты
	|ГДЕ
	|	НЕ Контакты.ПометкаУдаления
	|	И (&СтрокаПоиска = """"
	|		ИЛИ Контакты.Наименование ПОДОБНО &ШаблонПоиска
	|		ИЛИ Контакты.Телефон ПОДОБНО &ШаблонПоиска
	|		ИЛИ Контакты.Почта ПОДОБНО &ШаблонПоиска)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("СтрокаПоиска", СокрЛП(СтрокаПоиска));
	Запрос.УстановитьПараметр("ШаблонПоиска", "%" + СокрЛП(СтрокаПоиска) + "%");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция АкцентСчетов()
	
	Возврат Новый Структура("Кнопка", "#2563EB");
	
КонецФункции

Функция АкцентВалют()
	
	Возврат Новый Структура("Кнопка", "#0F766E");
	
КонецФункции

Функция АкцентКонтактов()
	
	Возврат Новый Структура("Кнопка", "#7C3AED");
	
КонецФункции

Процедура ДобавитьШапку(Строки, Стили)
	
	Строки.Добавить("<!DOCTYPE html><html lang=""ru""><head><meta charset=""utf-8"">");
	Строки.Добавить("<meta name=""viewport"" content=""width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"">");
	Строки.Добавить("<style>" + Стили + "</style></head><body>");
	
КонецПроцедуры

Процедура ДобавитьШапкуСписка(Строки, Заголовок, СтрокаПоиска, Плейсхолдер, Инфо)
	
	Строки.Добавить("<div class=""top"">");
	Строки.Добавить("<a class=""icon-btn"" href=""app:back"">" + SVGНазад() + "</a>");
	Строки.Добавить("<div class=""title"">" + ЭкранироватьHTML(Заголовок) + "</div>");
	Строки.Добавить("<a class=""icon-btn"" href=""app:add"">" + SVGПлюс() + "</a></div>");
	Строки.Добавить("<a class=""search"" href=""app:search""><span class=""search-text"">"
		+ ЭкранироватьHTML(?(ПустаяСтрока(СтрокаПоиска), Плейсхолдер, СтрокаПоиска)) + "</span></a>");
	Строки.Добавить("<div class=""info"">" + ЭкранироватьHTML(Инфо) + "</div>");
	
КонецПроцедуры

Процедура ДобавитьШапкуЭлемента(Строки, Заголовок, Предопределенный)
	
	Строки.Добавить("<div class=""top"">");
	Строки.Добавить("<a class=""icon-btn"" href=""app:back"">" + SVGНазад() + "</a>");
	Строки.Добавить("<div class=""title"">" + ЭкранироватьHTML(Заголовок) + "</div>");
	
	Если Предопределенный Тогда
		
		Строки.Добавить("<span class=""icon-btn ghost""></span>");
		
	Иначе
		
		Строки.Добавить("<a class=""icon-btn"" href=""app:delete"">" + SVGКорзина() + "</a>");
		
	КонецЕсли;
	
	Строки.Добавить("</div>");
	
КонецПроцедуры

Процедура ДобавитьКнопкуЗаписи(Строки, МожноЗаписать, ТекстАктивной, ТекстНеактивной)
	
	Класс = ?(МожноЗаписать, "btn", "btn disabled");
	Ссылка = ?(МожноЗаписать, "app:save", "app:noop");
	Текст = ?(МожноЗаписать, ТекстАктивной, ТекстНеактивной);
	Строки.Добавить("<div class=""footer""><a class=""" + Класс + """ href=""" + Ссылка + """>"
		+ ЭкранироватьHTML(Текст) + "</a></div>");
	
КонецПроцедуры

Функция СтилиСписка(Акцент)
	
	Возврат БазовыеСтили()
		+ ".top{display:flex;align-items:center;justify-content:space-between;margin-bottom:12px}"
		+ ".title{font-size:18px;font-weight:700}"
		+ ".icon-btn{width:40px;height:40px;border-radius:12px;background:#FFF;border:1px solid #E5E7EB;"
		+ "display:flex;align-items:center;justify-content:center}"
		+ ".icon-btn.ghost{visibility:hidden}"
		+ ".search{display:block;background:#FFF;border:1px solid #E5E7EB;border-radius:14px;padding:12px 14px;margin-bottom:10px}"
		+ ".search-text{color:#6B7280;font-size:14px}"
		+ ".info{background:#FFF;border:1px solid #E5E7EB;border-radius:14px;padding:12px 14px;color:#6B7280;font-size:13px;margin-bottom:12px}"
		+ ".list{display:flex;flex-direction:column;gap:8px;padding-bottom:24px}"
		+ ".list.choice{padding-bottom:88px}"
		+ ".item{display:flex;align-items:center;gap:12px;background:#FFF;border:1px solid #E5E7EB;border-radius:16px;padding:14px}"
		+ ".item.selected{border-color:#2563EB;background:#EFF6FF}"
		+ ".mid{flex:1;min-width:0;display:flex;flex-direction:column;gap:2px}"
		+ ".name{font-size:15px;font-weight:600}"
		+ ".sub{font-size:12px;color:#6B7280;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
		+ ".check{color:#2563EB;font-size:18px;font-weight:700}"
		+ ".chev{font-size:20px;color:#9CA3AF}"
		+ ".empty{text-align:center;color:#6B7280;padding:40px 12px}";
	
КонецФункции

Функция СтилиКнопки(Акцент)
	
	Возврат ".footer{position:fixed;left:0;right:0;bottom:0;padding:12px 16px 20px;background:linear-gradient(180deg,rgba(250,250,250,0),#FAFAFA 28%)}"
		+ ".btn{display:block;text-align:center;background:" + Акцент.Кнопка + ";color:#FFF;font-weight:700;"
		+ "font-size:15px;border-radius:14px;padding:14px 16px}";
	
КонецФункции

Функция СтилиЭлемента(Акцент)
	
	Возврат БазовыеСтили()
		+ ".top{display:flex;align-items:center;justify-content:space-between;margin-bottom:14px}"
		+ ".title{font-size:18px;font-weight:700}"
		+ ".icon-btn{width:40px;height:40px;border-radius:12px;background:#FFF;border:1px solid #E5E7EB;"
		+ "display:flex;align-items:center;justify-content:center}"
		+ ".icon-btn.ghost{visibility:hidden}"
		+ ".card{display:flex;flex-direction:column;gap:4px;background:#FFF;border:1px solid #E5E7EB;"
		+ "border-radius:16px;padding:14px;margin-bottom:10px}"
		+ ".label{font-size:12px;color:#6B7280}"
		+ ".value{font-size:15px;font-weight:600}"
		+ ".value.muted{font-weight:500;color:#6B7280}"
		+ ".info{background:#FFF;border:1px solid #E5E7EB;border-radius:14px;padding:12px 14px;"
		+ "color:#6B7280;font-size:13px;margin:8px 0 88px}"
		+ ".footer{position:fixed;left:0;right:0;bottom:0;padding:12px 16px 20px;background:linear-gradient(180deg,rgba(250,250,250,0),#FAFAFA 28%)}"
		+ ".btn{display:block;text-align:center;background:" + Акцент.Кнопка + ";color:#FFF;font-weight:700;"
		+ "font-size:15px;border-radius:14px;padding:14px 16px}"
		+ ".btn.disabled{background:#E5E7EB;color:#6B7280}";
	
КонецФункции

Функция БазовыеСтили()
	
	Возврат "*{box-sizing:border-box;margin:0;padding:0;-webkit-tap-highlight-color:transparent}"
		+ "body{font-family:-apple-system,BlinkMacSystemFont,""Segoe UI"",Roboto,Arial,sans-serif;"
		+ "background:#FAFAFA;color:#111827;padding:12px 16px 24px;line-height:1.35}"
		+ "a{text-decoration:none;color:inherit;display:block}";
	
КонецФункции

Функция SVGНазад()
	
	Возврат "<svg viewBox=""0 0 24 24"" width=""20"" height=""20"" fill=""none"" stroke=""#111827"" stroke-width=""2"">"
		+ "<path d=""M15 18l-6-6 6-6""/></svg>";
	
КонецФункции

Функция SVGПлюс()
	
	Возврат "<svg viewBox=""0 0 24 24"" width=""20"" height=""20"" fill=""none"" stroke=""#2563EB"" stroke-width=""2"">"
		+ "<path d=""M12 5v14M5 12h14""/></svg>";
	
КонецФункции

Функция SVGКорзина()
	
	Возврат "<svg viewBox=""0 0 24 24"" width=""20"" height=""20"" fill=""none"" stroke=""#9CA3AF"" stroke-width=""2"">"
		+ "<path d=""M3 6h18M8 6V4h8v2M6 6l1 14h10l1-14""/></svg>";
	
КонецФункции

#КонецОбласти
